app/views/wikis/edit.html.erb

SELECT "collaborators"."user_id" FROM "collaborators" WHERE "collaborators"."wiki_id" = ?  [["wiki_id", 25]]
---
        <%= f.label :collaborators %>
        <%= f.collection_select(:collaborator_ids, User.all, :id, :email, {selected: @wiki.collaborators.pluck(:user_id)}, {multiple: true})%>