app/views/wikis/new.html.erb

        <%= f.label :collaborators %>
        <%= f.collection_select(:collaborator_ids, User.all, :id, :email, {class: 'foo'}, {multiple: true})%>
---
SELECT "users".* FROM "users"