app/controllers/users_controller.rb

  def update
    @user = current_user
    @user.role = :standard
    @wikis = Wiki.select {|wiki| wiki.user = @user }
    @wikis.map! do |wiki|
      wiki.private = false
      wiki.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "wikis".* FROM "wikis"
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", 0], ["updated_at", "2017-07-19 08:34:57.511016"], ["id", 6]]
UPDATE "wikis" SET "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["private", "f"], ["updated_at", "2017-07-20 23:16:17.515124"], ["id", 1]]