app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"