app/controllers/wikis_controller.rb

  def create
    @wiki = Wiki.new
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]
    @wiki.user = current_user

    add_collaborators(@wiki, params[:wiki][:collaborator_ids])

    if current_user.standard?
      @wiki.private = false
    else
      @wiki.private = false || true
    end

    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new new new"], ["body", "NEW NEW NEW"], ["user_id", 6], ["created_at", "2017-07-18 19:51:57.668329"], ["updated_at", "2017-07-18 19:51:57.668329"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.title = params[:wiki][:title]
    @wiki.body = params[:wiki][:body]
    @wiki.private = params[:wiki][:private]
    if params[:wiki][:collaborators]
      @wiki.collaborators = []
      add_collaborators(@wiki, params[:wiki][:collaborator_ids])
    end


    if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "collaborators" SET "wiki_id" = NULL WHERE "collaborators"."wiki_id" = ? AND "collaborators"."id" IN (2, 3, 4)  [["wiki_id", 25]]
UPDATE "wikis" SET "body" = ?, "private" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["body", "asdfasdfasdfasdfasdfasdfasdfasdfasdfasdfasdfasdfads"], ["private", nil], ["updated_at", "2017-07-27 18:32:18.418754"], ["id", 25]]

  def destroy
    @wiki = Wiki.find(params[:id])

    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]